step_hit_processor_factory.org
#+TITLE:  Step Hit Processor Configuration
#+AUTHOR: Xavier Garrido
#+DATE:   2013-03-04
#+OPTIONS: ^:{}
#+STARTUP: entitiespretty

* Introduction

This file holds the configuration for the different Step Hit Processors (SHP)
used with SuperNEMO simulations. The basic idea behind SHP is to treat Geant4
step hits given the sensitive categories in where they occurs. Each Geant4 step
is "digitized" and if the step is within a sensitive category with attached SHP
then the step is processed. For SuperNEMO simulations there are mainly two kind
of physics processors: Geiger cells and calorimeter processors.

There is also a third kind of processors which handles /visual/ hits to make
them visible given a list of sensitive categories.

* Processors
:PROPERTIES:
:TANGLE: step_hit_processor_manager.conf
:END:

#+BEGIN_SRC shell
  #@description A sample list of setups
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC

** Calorimeter processors
This processor collects all MC true hits from the calorimeter scintillator
volumes (with the =calorimeter_SD= sensitive category property) and build
calorimeter-like "calo" hits associated to the calorimeter scintillator block
GID. The purpose of this processing is to build a single "calo" hit from the
collection of true hits produced by a particle traversing the block. Both the
start time and the total energy deposit are recorded in the "calo" hit.

There are few options for calorimeter processors :
- a =hit.category= is attached to each Geant4 step hits,
- the corresponding =sensitive.category= must be set,
- =cluster.time_range= and =cluster.time_space= are related to the clustering of
  Geant4 step hits.

The basic idea is to aggregate Geant4 step hits given the =cluster.time_range=
and the =cluster.time_space= into a unique calorimeter hit.

*** Main wall
#+BEGIN_SRC shell
  [name="calorimeter.hit_processor" type="snemo::simulation::calorimeter_step_hit_processor"]

  #@config The step hit processor for the calorimeter simulated hits

  #@description Logging flag
  logging.priority               : string = "warning"
  #@description The name of the category of output MC hits generated by this processor
  hit.category                   : string = "calo"
  #@description The name of the sensitive MC hits that must be processed to fill the output hit category
  sensitive.category             : string = "calorimeter_SD"
  #@description Flag to activate a preallocated buffer/pool of MC hits to optimize memory management
  use_private_pool               : boolean = 1
  #@description Initial capacity of the buffer/pool of MC hits
  private_pool_capacity          : integer = 10
  #@description The name of the geometry category to be attached to the output MC hits
  mapping.category               : string = "calorimeter_block"
  #@description The names of the subaddresses not to be considered in the GID
  mapping.category.any_addresses : string[1] = "part"
  #@description The time spread of primary MC step hits to apply the clusterization
  cluster.time_range             : real as time = 1.0 ns
  #@description The spacial spread of primary MC step hits to apply the clusterization
  cluster.space_range            : real as length = 10.0 mm
#+END_SRC

*** X-wall
#+BEGIN_SRC shell
   [name="xcalo.hit_processor" type="snemo::simulation::calorimeter_step_hit_processor"]

   #@config The step hit processor for the auxiliary calorimeter simulated hits

   #@description Logging flag
   logging.priority    : string  = "warning"
   #@description The name of the category of output MC hits generated by this processor
   hit.category        : string  = "xcalo"
   #@description The name of the sensitive MC hits that must be processed to fill the output hit category
   sensitive.category  : string  = "xcalorimeter_SD"
   #@description The name of the sensitive MC hits that must be processed to fill the output hit category
   mapping.category    : string  = "xcalo_block"
   #@description The time spread of primary MC step hits to apply the clusterization
   cluster.time_range  : real as time   =  1.0 ns
   #@description The spacial spread of primary MC step hits to apply the clusterization
   cluster.space_range : real as length = 10.0 mm
#+END_SRC
