step_hit_processor_factory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Step Hit Processor Configuration</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="css/styles.css" />
               <link rel="stylesheet" href="css/org-pygments.css" />
               <link rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css" />
</head>
<body onload="randomLinkColor();displayTOC();"><div id="toc"></div>
<div id="preamble" class="status">
<a href="index.html"><i class="fa fa-home"></i></a><br/> <a href="https://github.com/xgarrido/snemo_simulation_configuration"><i class="fa fa-github"></i></a><br/>
</div>
<div id="content">
<h1 class="title">Step Hit Processor Configuration</h1>
<div id="table-of-contents">
<h2></h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Processors</a>
<ul>
<li><a href="#sec-2-1">2.1. Calorimeter processors</a></li>
<li><a href="#sec-2-2">2.2. Geiger cells processors</a></li>
<li><a href="#sec-2-3">2.3. Visualization processors</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This file holds the configuration for the different Step Hit Processors (SHP)
used with SuperNEMO simulations. The basic idea behind SHP is to treat Geant4
step hits given the sensitive categories in where they occurs. Each Geant4 step
is "digitized" and if the step is within a sensitive category with attached SHP
then the step is processed. For SuperNEMO simulations there are mainly two kind
of physics processors: Geiger cells and calorimeter processors.
</p>

<p>
There is also a third kind of processors which handles <i>visual</i> hits to make
them visible given a list of sensitive categories.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Processors</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Calorimeter processors</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This processor collects all MC true hits from the calorimeter scintillator
volumes (with the <code>calorimeter_SD</code> sensitive category property) and build
calorimeter-like "calo" hits associated to the calorimeter scintillator block
GID. The purpose of this processing is to build a single "calo" hit from the
collection of true hits produced by a particle traversing the block. Both the
start time and the total energy deposit are recorded in the "calo" hit.
</p>

<p>
There are few options for calorimeter processors :
</p>
<ul class="org-ul">
<li>a <code>hit.category</code> is attached to each Geant4 step hits,
</li>
<li>the corresponding <code>sensitive.category</code> must be set,
</li>
<li><code>cluster.time_range</code> and <code>cluster.time_space</code> are related to the clustering of
Geant4 step hits.
</li>
</ul>

<p>
The basic idea is to aggregate Geant4 step hits given the <code>cluster.time_range</code>
and the <code>cluster.time_space</code> into a unique calorimeter hit.
</p>
</div>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Main wall</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"calorimeter.hit_processor"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mctools::calorimeter_step_hit_processor"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The step hit processor for the calorimeter simulated hits</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging flag</span>
logging.priority               : <span class="org-variable-name">string</span>  = <span class="org-string">"warning"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the category of output MC hits generated by this processor</span>
hit.category                   : <span class="org-variable-name">string</span>  = <span class="org-string">"calo"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the sensitive MC hits that must be processed to fill the output hit category</span>
sensitive.category             : <span class="org-variable-name">string</span>  = <span class="org-string">"calorimeter_SD"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to activate a preallocated buffer/pool of MC hits to optimize memory management</span>
use_private_pool               : <span class="org-variable-name">boolean</span> = 1
<span class="org-comment-delimiter">#</span><span class="org-comment">@description Initial capacity of the buffer/pool of MC hits</span>
private_pool_capacity          : <span class="org-variable-name">integer</span> = 10
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the geometry category to be attached to the output MC hits</span>
mapping.category               : <span class="org-variable-name">string</span>    = <span class="org-string">"calorimeter_block"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The names of the subaddresses not to be considered in the GID</span>
mapping.category.any_addresses : <span class="org-variable-name">string</span>[1] = <span class="org-string">"part"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The time spread of primary MC step hits to apply the clusterization</span>
cluster.time_range             : real as <span class="org-variable-name">time</span>   =  1.0 ns
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The spacial spread of primary MC step hits to apply the clusterization</span>
cluster.space_range            : real as <span class="org-variable-name">length</span> = 10.0 mm
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> X-wall</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"xcalo.hit_processor"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mctools::calorimeter_step_hit_processor"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The step hit processor for the auxiliary calorimeter simulated hits</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging flag</span>
logging.priority    : <span class="org-variable-name">string</span>  = <span class="org-string">"warning"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the category of output MC hits generated by this processor</span>
hit.category        : <span class="org-variable-name">string</span>  = <span class="org-string">"xcalo"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the sensitive MC hits that must be processed to fill the output hit category</span>
sensitive.category  : <span class="org-variable-name">string</span>  = <span class="org-string">"xcalorimeter_SD"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the sensitive MC hits that must be processed to fill the output hit category</span>
mapping.category    : <span class="org-variable-name">string</span>  = <span class="org-string">"xcalo_block"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The time spread of primary MC step hits to apply the clusterization</span>
cluster.time_range  : real as <span class="org-variable-name">time</span>   =  1.0 ns
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The spacial spread of primary MC step hits to apply the clusterization</span>
cluster.space_range : real as <span class="org-variable-name">length</span> = 10.0 mm
</pre>
</div>
</div>
</div>
