step_hit_processor_factory.org
*** \gamma veto
#+BEGIN_SRC shell
  [name="gveto.hit_processor" type="snemo::simulation::calorimeter_step_hit_processor"]

  #@config The step hit processor for the gamma veto simulated hits

  #@description Logging flag
  logging.priority    : string  = "warning"
  #@description The name of the category of output MC hits generated by this processor
  hit.category        : string  = "gveto"
  #@description The name of the sensitive MC hits that must be processed to fill the output hit category
  sensitive.category  : string  = "gveto_SD"
  #@description The name of the sensitive MC hits that must be processed to fill the output hit category
  mapping.category    : string  = "gveto_block"
  #@description The time spread of primary MC step hits to apply the clusterization
  cluster.time_range  : real as time   =  1.0 ns
  #@description The spacial spread of primary MC step hits to apply the clusterization
  cluster.space_range : real as length = 10.0 mm
#+END_SRC

** Geiger cells processors
This processor collects all MC true hits from the drift cell volumes (with the
=tracker_SD= sensitive category property) and builds Geiger-like hits associated
to a given drift cell ID. It generates randomly distributed primary ionizations
along the true step of a given particle (electron/positron, muon, alpha...) and
records the time and position of the ionization process that is closest to the
anode wire. Optionally it is possible to record the true time and position of
the minimal approach distance to the anode wire.


#+BEGIN_SRC shell
   [name="gg.hit_processor" type="snemo::simulation::gg_step_hit_processor"]

   #@config The step hit processor for the Geiger simulated hits

   #@description Logging flag
   logging.priority       : string  = "warning"
   #@description The name of the category of output MC hits generated by this processor
   hit.category           : string  = "gg"
   #@description The name of the sensitive MC hits that must be processed to fill the output hit category
   sensitive.category     : string  = "tracker_SD"
   #@description The name of the geometry category to be attached to the output MC hits
   mapping.category       : string  = "drift_cell_core"
   #@description Mean ionization energy used to randomize electron-ion pairs along the particle path
   mean_ionization_energy : real as energy = 50.0 eV
   #@description For each cell traversed by a track, compute the position of maximal approach to the anode wire (debug purpose only so default is 0)
   compute_maximal_approach_position : boolean = 0
#+END_SRC

** Visualization processors

*** Dedicated step hit processors
#+BEGIN_SRC shell
  [name="calorimeter.visu.hit_processor" type="mctools::push_all_step_hit_processor"]

  #@config The step hit processor for collecting the calorimeter simulated hits

  #@description Logging flag
  logging.priority   : string = "warning"
  #@description The category of output hit associated to this processor
  hit.category       : string = "__visu.tracks"
  #@description The name of the sensitive MC hits that must be processed to fill the output hit category
  sensitive.category : string = "calorimeter_SD"

  [name="xcalorimeter.visu.hit_processor" type="mctools::push_all_step_hit_processor"]

  #@config The step hit processor for collecting the calorimeter simulated hits

  #@description Logging flag
  logging.priority   : string = "warning"
  #@description The category of output hit associated to this processor
  hit.category       : string = "__visu.tracks"
  #@description The name of the sensitive MC hits that must be processed to fill the output hit category
  sensitive.category : string = "xcalorimeter_SD"

  [name="gveto.visu.hit_processor" type="mctools::push_all_step_hit_processor"]

  #@config The step hit processor for collecting the calorimeter simulated hits

  #@description Logging flag
  logging.priority   : string = "warning"
  #@description The category of output hit associated to this processor
  hit.category       : string = "__visu.tracks"
  #@description The name of the sensitive MC hits that must be processed to fill the output hit category
  sensitive.category : string = "gveto_SD"

  [name="tracker.visu.hit_processor" type="mctools::push_all_step_hit_processor"]

  #@config The step hit processor for collecting the tracker simulated hits

  #@description Logging flag
  logging.priority   : string = "warning"
  #@description The category of output hit associated to this processor
  hit.category       : string = "__visu.tracks"
  #@description The name of the sensitive MC hits that must be processed to fill the output hit category
  sensitive.category : string = "tracker_SD"
#+END_SRC

