step_hit_processor_factory.html
<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> &gamma; veto</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"gveto.hit_processor"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mctools::calorimeter_step_hit_processor"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The step hit processor for the gamma veto simulated hits</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging flag</span>
logging.priority    : <span class="org-variable-name">string</span>  = <span class="org-string">"warning"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the category of output MC hits generated by this processor</span>
hit.category        : <span class="org-variable-name">string</span>  = <span class="org-string">"gveto"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the sensitive MC hits that must be processed to fill the output hit category</span>
sensitive.category  : <span class="org-variable-name">string</span>  = <span class="org-string">"gveto_SD"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the sensitive MC hits that must be processed to fill the output hit category</span>
mapping.category    : <span class="org-variable-name">string</span>  = <span class="org-string">"gveto_block"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The time spread of primary MC step hits to apply the clusterization</span>
cluster.time_range  : real as <span class="org-variable-name">time</span>   =  1.0 ns
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The spacial spread of primary MC step hits to apply the clusterization</span>
cluster.space_range : real as <span class="org-variable-name">length</span> = 10.0 mm
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Geiger cells processors</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This processor collects all MC true hits from the drift cell volumes (with the
<code>tracker_SD</code> sensitive category property) and builds Geiger-like hits associated
to a given drift cell ID. It generates randomly distributed primary ionizations
along the true step of a given particle (electron/positron, muon, alpha&#x2026;) and
records the time and position of the ionization process that is closest to the
anode wire. Optionally it is possible to record the true time and position of
the minimal approach distance to the anode wire.
</p>


<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"gg.hit_processor"</span> <span class="org-variable-name">type</span>=<span class="org-string">"snemo::simulation::gg_step_hit_processor"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The step hit processor for the Geiger simulated hits</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging flag</span>
logging.priority       : <span class="org-variable-name">string</span>  = <span class="org-string">"warning"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the category of output MC hits generated by this processor</span>
hit.category           : <span class="org-variable-name">string</span>  = <span class="org-string">"gg"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the sensitive MC hits that must be processed to fill the output hit category</span>
sensitive.category     : <span class="org-variable-name">string</span>  = <span class="org-string">"tracker_SD"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the geometry category to be attached to the output MC hits</span>
mapping.category       : <span class="org-variable-name">string</span>  = <span class="org-string">"drift_cell_core"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description Mean ionization energy used to randomize electron-ion pairs along the particle path</span>
mean_ionization_energy : real as <span class="org-variable-name">energy</span> = 50.0 eV
<span class="org-comment-delimiter">#</span><span class="org-comment">@description For each cell traversed by a track, compute the position of maximal approach to the anode wire (debug purpose only so default is 0)</span>
compute_maximal_approach_position : <span class="org-variable-name">boolean</span> = 0
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Visualization processors</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Dedicated step hit processors</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"calorimeter.visu.hit_processor"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mctools::push_all_step_hit_processor"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The step hit processor for collecting the calorimeter simulated hits</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging flag</span>
logging.priority   : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The category of output hit associated to this processor</span>
hit.category       : <span class="org-variable-name">string</span> = <span class="org-string">"__visu.tracks"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the sensitive MC hits that must be processed to fill the output hit category</span>
sensitive.category : <span class="org-variable-name">string</span> = <span class="org-string">"calorimeter_SD"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"xcalorimeter.visu.hit_processor"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mctools::push_all_step_hit_processor"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The step hit processor for collecting the calorimeter simulated hits</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging flag</span>
logging.priority   : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The category of output hit associated to this processor</span>
hit.category       : <span class="org-variable-name">string</span> = <span class="org-string">"__visu.tracks"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the sensitive MC hits that must be processed to fill the output hit category</span>
sensitive.category : <span class="org-variable-name">string</span> = <span class="org-string">"xcalorimeter_SD"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"gveto.visu.hit_processor"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mctools::push_all_step_hit_processor"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The step hit processor for collecting the calorimeter simulated hits</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging flag</span>
logging.priority   : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The category of output hit associated to this processor</span>
hit.category       : <span class="org-variable-name">string</span> = <span class="org-string">"__visu.tracks"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the sensitive MC hits that must be processed to fill the output hit category</span>
sensitive.category : <span class="org-variable-name">string</span> = <span class="org-string">"gveto_SD"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"tracker.visu.hit_processor"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mctools::push_all_step_hit_processor"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The step hit processor for collecting the tracker simulated hits</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging flag</span>
logging.priority   : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The category of output hit associated to this processor</span>
hit.category       : <span class="org-variable-name">string</span> = <span class="org-string">"__visu.tracks"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the sensitive MC hits that must be processed to fill the output hit category</span>
sensitive.category : <span class="org-variable-name">string</span> = <span class="org-string">"tracker_SD"</span>
</pre>
</div>
</div>
</div>
